Revit 2027 API
TopographySurface.IsValidRegion Method
 Identify whether the points can construct a valid region for a topography surface.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidRegion(
	IList<XYZ> points
)
Public Shared Function IsValidRegion (
	points As IList(Of XYZ)
) As Boolean
public:
static bool IsValidRegion(
	IList<XYZ^>^ points
)
static member IsValidRegion :
        points : IList<XYZ> -> bool
Parameters
points IList<XYZ>
 The points set to be checked.
Return Value
Boolean
 True if the size of points is not less than 3 and the points are not collinear after projecting to XY plane, that is, ignoring the elevation.
Exceptions
Exception | Condition
ArgumentException |  There are no points in the input points set.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
TopographySurface Class
Autodesk.Revit.DB.Architecture Namespace